import React from 'react';
import {
  Box,
  Container,
  Flex,
  Heading,
  Image,
  Text,
  UnorderedList,
  ListItem,
} from '@chakra-ui/react';
import recyclingImg from '../../img/recycling/recycling1.jpg';
import recyclingImg2 from '../../img/recycling/recycling2.jpg';

const Recycling = () => {
  return (
    <Flex backgroundColor="white.300" justifyContent="center" w="100%">
      <Container maxW="1400px" p="40px 30px" mt="111px">
        <Flex direction="column" gridGap="50px">
          <Heading
            as="h1"
            textAlign="center"
            fontSize={{ base: '30px', lg: '48px' }}
            fontWeight="700"
            color="green.100"
          >
            Утилізація
          </Heading>
          <Flex
            direction={{ base: 'column', xl: 'row' }}
            alignItems={{ base: 'center', xl: 'flex-start' }}
            justifyContent="space-evenly"
            gridGap={{ base: '40px', xl: 'none' }}
          >
            <Image
              src={recyclingImg}
              maxW={{ base: '300px', lg: '500px' }}
              maxH={{ base: '300px', lg: '500px' }}
            />
            <Box minW="300px" maxW="500px">
              <Text fontSize="18px" fontWeight="400">
                Знищення та переробка відходів для вторинного використання
                вторсировини – практика, що набирає популярності в Україні, яка
                вже давно застосовується в більшості цивілізованих країн.
                Утилізація та вторинна переробка дозволяє зберігати природні
                ресурси. Здавши нам вторинну сировину ви знижуєте відсоток
                забруднення екології, а також це є екологічно правильним, та
                економічно вигідним процесом.
                <br />
                <br />
                Наразі здати відходи може кожен охочий. Зібрані побутові відходи
                проходять кілька етапів обробки, очищення та заготівлі для
                подальшої переробки. Завдяки такій переробці вторинне сировину
                можна використовувати повторно кілька разів. При цьому воно не
                втрачає своїх первісних властивостей, якостей та характеристик.
              </Text>
            </Box>
          </Flex>

          <Flex
            direction={{ base: 'column-reverse', xl: 'row' }}
            alignItems={{ base: 'center', xl: 'flex-start' }}
            justifyContent="space-evenly"
            gridGap={{ base: '40px', xl: 'none' }}
          >
            <Flex direction="column" gridGap="20px" minW="300px" maxW="500px">
              <Text fontSize="18px" fontWeight="400">
                Переробка побутових відходів в Україні стає все більш поширеною
                та затребуваною, завдяки появі підприємств, що здійснюють
                прийом, вивезення, утилізацію, сортування та заготівлю вторинної
                сировини. Здаючи відходи на переробку, ви вносите неоціненний
                внесок у збереження чистоти навколишнього середовища та
                екології. Роздільний збір та сортування відходів – це те, до
                чого має відповідально підходити кожна свідома людина. <br />
                <br />
                Компанія «ZA_ECO» здійснює роздільне збирання відходів у м.
                Боярка. Ми займаємося прийомом, вивезенням та утилізацією
                відходів, що вдруге переробляються. Оперативна утилізація та
                вивіз сміття власною технікою компанії дозволяє здійснити
                якісний та оперативний вивіз вторинної сировини, скла, пластику,
                металу здати неробочу техніку, а також різні типи побутових
                відходів та сировини, що підлягає вторинній переробці.
              </Text>
            </Flex>
            <Image
              src={recyclingImg2}
              maxW={{ base: '300px', lg: '500px' }}
              maxH={{ base: '300px', lg: '500px' }}
            />
          </Flex>

          <Flex
            direction="column"
            gridGap="15px"
            fontSize="18px"
            fontWeight="400"
          >
            <Text>
              Компанія «ZA_ECO» приймає для утилізації такі види вторинної
              сировини:
            </Text>
            <UnorderedList ml="50px">
              <ListItem>
                Білий офісний папір, картон, труби, шпулі, картонні гільзи,
                куточки, коробки, гофротара, гофроящики;
              </ListItem>
              <ListItem>
                Книги, А4, зошити, журнали, архіви, бібліотеки;
              </ListItem>
              <ListItem>
                ПЕТ пляшку прозору, блакитну, коричневу, зелену, змішану;
              </ListItem>
              <ListItem>
                Відра, тазики, труби, таці, горщики, ручки, кришки та інші
                пластмасові вироби;
              </ListItem>
              <ListItem>
                Поліетилен (плівка) мікс, Термозбіжна, високого тиску 1 сорт, 2
                сорт, стрейч, кольорова, ПНД, ПВД, кульки, пакети;
              </ListItem>
              <ListItem>
                Чорний метал, Алюміній, дюраль, профіль, харчовий алюміній
                технічний, стружку, кабелю, чушки.
              </ListItem>
              <ListItem>
                Профіль, латунь, нержавіюча сталь, ЦАМ, магній, фольга,
                акумулятори, радіатори Алюмінієві баночки, свинець, мідь,
                віконний профіль, пластмасове підвіконня, штапики;
              </ListItem>
              <ListItem>
                Білий (прозорий), листовий склобій, кольоровий склобій, Віконне
                скло, пивна тара;
              </ListItem>
              <ListItem>
                Каністри, Пляшки з під побутової Хімії, флакони, барила, відра
                ПП ПЕ, Ящики, ПВХ, картки, труби, Полістирол кольоровий, білий.
              </ListItem>
              <ListItem>
                Акрил(Оргскло), ,Полікарбонат(Оргтехніка, Принтери ,
                Комп&apos;ютери), ABS(Кришки з під холодильників, Телевізорів)
              </ListItem>
            </UnorderedList>
          </Flex>
          <Text fontSize="18px" fontWeight="400">
            Утилізація та вивіз вашого сортованого сміття здійснюється
            транспортом компанії «ZA_ECO». За наявності вторинної сировини
            загальною вагою, яка перевищує 300 кг, виїзд буде для замовника
            абсолютно безкоштовним. Для утилізації ваших побутових відходів
            надаються машини загальною вантажністю до 10 тонн, що дозволяє за
            раз вивезти все сміття. Щоб замовити послугу утилізації сміття,
            залиште заявку менеджеру компанії, зателефонувавши за номером,
            вказаним на сайті передчасно за 1 день. Компанія «ZA_ECO» також
            надає послуги вантажників для оперативного винесення та навантаження
            вторинної сировини. Зважування вторинної сировини та оплата при
            прийомі для утилізації проводиться відразу на місці.
          </Text>
        </Flex>
      </Container>
    </Flex>
  );
};

export default Recycling;
