import React from 'react';
import {
  Box,
  Container,
  Flex,
  Heading,
  Image,
  ListItem,
  Text,
  UnorderedList,
} from '@chakra-ui/react';
import glass from '../../img/cullet/glass.jpeg';
import cullet from '../../img/cullet/сullet.jpeg';

const Cullet = () => {
  return (
    <Flex backgroundColor="white.300" justifyContent="center" w="100%">
      <Container maxW="1400px" p="40px 30px" mt="111px">
        <Flex direction="column" gridGap="50px">
          <Heading
            as="h1"
            textAlign="center"
            fontSize={{ base: '30px', lg: '48px' }}
            fontWeight="700"
            color="green.100"
          >
            Переробляємо скло – заощаджуємо енергію!
          </Heading>
          <Flex
            direction={{ base: 'column', xl: 'row' }}
            alignItems={{ base: 'center', xl: 'flex-start' }}
            justifyContent="space-evenly"
            gridGap={{ base: '40px', xl: 'none' }}
          >
            <Image
              src={cullet}
              maxW={{ base: '300px', lg: '500px' }}
              maxH={{ base: '300px', lg: '500px' }}
            />
            <Box minW="300px" maxW="500px">
              <Text fontSize="18px" fontWeight="400">
                Переробка скла – один із багатьох способів скоротити забруднення
                планети та знизити кількість відходів. Вона життєво необхідна
                для міст у всьому світі та людей, які живуть у них. Замість
                того, щоб викидати на сміттєзвалища скляні предмети, які
                загрожують безпеці та навколишньому середовищу, ми можемо
                використовувати їх знову і знову. Адже скло – вражаючий
                матеріал, який на 100% підлягає вторинній переробці та може
                безкінечно перероблятися без втрати чистоти чи якості. <br />
                <br /> Є так багато причин не викидати, а здати склобій! Бажаєте
                зберегти природні ресурси для майбутніх поколінь? Тоді
                звертайтеся до наших пунктів прийому скла.
              </Text>
            </Box>
          </Flex>

          <Flex
            direction={{ base: 'column-reverse', xl: 'row' }}
            alignItems={{ base: 'center', xl: 'flex-start' }}
            justifyContent="space-evenly"
            gridGap={{ base: '40px', xl: 'none' }}
          >
            <Flex direction="column" gridGap="20px" minW="300px" maxW="500px">
              <Text fontSize="18px" fontWeight="400">
                Наша компанія здійснює прийом скла, вивезення склотари, склобою,
                вивезення листового та битого скла у Києві та Боярці для того,
                щоб воно заграло новим життям. Так-так, його можна розплавити і
                знову перетворити на різні форми – від склянок до скловолокна. У
                наших пунктах прийому скла Ви можете здати склотару, склобій. Ми
                також купуємо склобій. <br />
                <br /> Бажаєте дізнатися шлях ваших розбитих та непотрібних
                пляшок та банок до нового життя? Розповідаємо нижче &#8595;
              </Text>
            </Flex>
            <Image
              src={glass}
              maxW={{ base: '300px', lg: '500px' }}
              maxH={{ base: '300px', lg: '500px' }}
            />
          </Flex>
          <Heading
            as="h2"
            textAlign="center"
            fontSize={{ base: '26px', lg: '40px' }}
            fontWeight="700"
            color="green.100"
          >
            &rdquo;Реінкарнація&rdquo; непотрібних скляних виробів
          </Heading>
          <Text fontSize="18px" fontWeight="400" textAlign="center">
            Розбиті шматочки скла сортуються за кольором і промиваються
            видалення будь-яких забруднень. Потім його подрібнюють і готують до
            змішування з іншою сировиною, такою як кальцинована сода та пісок.
            Сировина та шматочки скла плавляться в печі, а потім заливаються у
            форми для виготовлення нових пляшок, графинів, глечиків різних
            кольорів та розмірів. У процесі виробництва скла можна додавати
            додаткову сировину, щоб надати склу особливий колір або особливі
            якості: так, залізо можна додавати, щоб надати виробу коричневого
            або зеленого кольору, кобальт – для виробів блакитного кольору,
            глинозем треба додавати для міцності виробів, а бор – для покращення
            стійкості до тепла чи холоду. Склобій також може стати ізоляцією зі
            скловати, яка допомагає підвищити енергоефективність Вашого житла.
            Дивно, чи не так?
          </Text>
          <Heading
            as="h2"
            textAlign="center"
            fontSize={{ base: '26px', lg: '40px' }}
            fontWeight="700"
            color="green.100"
          >
            Переваги переробки скла
          </Heading>
          <UnorderedList fontSize="18px" fontWeight="400">
            <ListItem>
              Для виробництва нового скла потрібно багато енергії: спочатку для
              транспортування матеріалів у піч, а потім для їх нагрівання до
              високої температури. Ефективна піч спалює 4 гігаджоулі (ГДж), щоб
              розплавити кожну тонну скла. Додавання склобою в піч у процесі
              виробництва скла суттєво знижує потребу в енергії (порівняно з
              отриманням скла з сировини вперше, склобій плавиться за більш
              низької температури).
            </ListItem>
            <ListItem>
              Скло, виготовлене з переробленого склобою, значно знижує
              забруднення повітря та води.
            </ListItem>
            <ListItem>
              Переробка скла збільшує простір на звалищах, який інакше зайняли б
              використані пляшки та банки.
            </ListItem>
          </UnorderedList>
          <Text fontSize="18px" fontWeight="400" textAlign="center">
            Якщо Ви давно замислюєтеся над екологічними проблемами нашої планети
            і хочете нарешті приєднатися до важливої місії її збереження,
            звертайтесь до наших пунктів прийому скла у Києві та Боярці.
          </Text>
        </Flex>
      </Container>
    </Flex>
  );
};

export default Cullet;
