import React from 'react';
import {
  Box,
  Container,
  Flex,
  Heading,
  Image,
  ListItem,
  Text,
  UnorderedList,
} from '@chakra-ui/react';
import microchips from '../../img/microchips/microchips.jpeg';

const Microchips = () => {
  return (
    <Flex backgroundColor="white.300" justifyContent="center" w="100%">
      <Container maxW="1400px" p="40px 30px" mt="111px">
        <Flex direction="column" gridGap="50px">
          <Heading
            as="h1"
            textAlign="center"
            fontSize={{ base: '30px', lg: '48px' }}
            fontWeight="700"
            color="green.100"
          >
            Скупка плат та мікросхем у Києві та Боярці за максимально вигідною
            ціною
          </Heading>
          <Flex
            direction={{ base: 'column', xl: 'row' }}
            alignItems={{ base: 'center', xl: 'flex-start' }}
            justifyContent="space-evenly"
            gridGap={{ base: '40px', xl: 'none' }}
          >
            <Image
              src={microchips}
              maxW={{ base: '300px', lg: '500px' }}
              maxH={{ base: '300px', lg: '500px' }}
            />
            <Box minW="300px" maxW="500px">
              <Text fontSize="18px" fontWeight="400">
                Купівля плат і мікросхем – один із найбільш затребуваних
                напрямків на вторинному ринку. Завдяки змісту певної кількості
                дорогоцінних металів, розбір офісних приладів та оргтехніки на
                елементи залишається актуальним та вигідним. Незважаючи на
                менший вміст цінних металів у сучасних девайсах, збирання та
                вивезення технічного мотлоху продовжує користуватися попитом у
                Києві. Ви можете здати нам на розбирання радянські магнітофони,
                телевізори, комп&apos;ютерні плати та радіо деталі різних
                поколінь – це і ще багато іншої електроніки.
                <br />
                <br /> Ви хочете продати електронні деталі за привабливою ціною
                і заодно позбавитися від мотлоху? Наша компанія активно
                співпрацює з багатьма сервісними центрами, великими виробничими
                підприємствами, приватними особами. Ми спеціалізуємося на оцінці
                та скуповуванні плат у Києві та гарантуємо ціну на користь
                клієнта.
              </Text>
            </Box>
          </Flex>

          <Heading
            as="h2"
            textAlign="center"
            fontSize={{ base: '26px', lg: '40px' }}
            fontWeight="700"
            color="green.100"
          >
            Як проводиться оцінка радіодеталей, електроніки на брухт
          </Heading>

          <Text fontSize="18px" fontWeight="400" textAlign="center">
            Якщо вам потрібно вивезти непотрібні пристрої, які займають місце та
            містять плати, мікросхеми та радіодеталі – ми пропонуємо розглянути
            співпрацю з нами. Це набагато вигідніше, ніж просто викинути
            потенційно прибуткову техніку на смітник або намагатися самостійно
            вилучити потрібні деталі для подальшого продажу.
          </Text>

          <Box fontSize="18px" fontWeight="400">
            <Text>
              Переваги, щоб вибрати нашу компанію для продажу неробочих
              електронних деталей у Києві:
            </Text>

            <UnorderedList>
              <ListItem>
                Розумне та вигідне рішення для власників бізнесу та приватних
                осіб. Вибираючи нас, ви отримуєте чесну оцінку деталей та їхню
                реальну ринкову вартість. Ми не прагнемо обдурити клієнта та
                знизити ціну до мінімуму, як це робить безліч несумлінних фірм
                на українському ринку. Реалізація цінних запчастин проходить
                вигідно та без підводного каміння!
              </ListItem>
              <ListItem>
                Безкоштовна консультація спеціаліста. Ви можете зв&apos;язатися
                з нашим менеджером і він проінформує вас про вартість тих чи
                інших елементів.
              </ListItem>
              <ListItem>
                Зручність клієнта. Ми прагнемо надати якісний сервіс та готові
                працювати для подальшої співпраці. Проводимо виїзд власним
                транспортом у призначений час для оцінки та покупки ваших
                деталей та електроніки по Києву.
              </ListItem>
              <ListItem>
                Надаємо всі супутні документи, акти про знищення та утилізації.
              </ListItem>
              <ListItem>Зручна форма оплати.</ListItem>
            </UnorderedList>
          </Box>

          <Text fontSize="18px" fontWeight="400" textAlign="center">
            Прямо зараз дізнайтесь попередню вартість електроніки та
            радіодеталей з виїздом нашого спеціаліста на ваш об&apos;єкт.
            Звільніть простір навколо себе та отримайте вигоду від співпраці з
            перевіреною компанією у Києві.
          </Text>
        </Flex>
      </Container>
    </Flex>
  );
};

export default Microchips;
