import React from 'react';
import {
  Box,
  Container,
  Flex,
  Heading,
  Image,
  ListItem,
  Text,
  UnorderedList,
} from '@chakra-ui/react';
import bottle from '../../img/plastic/bottle.jpeg';
import cap from '../../img/plastic/cap.jpeg';
import general from '../../img/plastic/general.jpeg';

const Plastic = () => {
  return (
    <Flex backgroundColor="white.300" justifyContent="center" w="100%">
      <Container maxW="1400px" p="40px 30px" mt="111px">
        <Flex direction="column" gridGap="50px">
          <Heading
            as="h1"
            textAlign="center"
            fontSize={{ base: '30px', lg: '48px' }}
            fontWeight="700"
            color="green.100"
          >
            Приєднуйтесь до нашої боротьби за екологічний простір!
          </Heading>
          <Flex
            direction={{ base: 'column', xl: 'row' }}
            alignItems={{ base: 'center', xl: 'flex-start' }}
            justifyContent="space-evenly"
            gridGap={{ base: '40px', xl: 'none' }}
          >
            <Image
              src={bottle}
              maxW={{ base: '300px', lg: '500px' }}
              maxH={{ base: '300px', lg: '500px' }}
            />
            <Box minW="300px" maxW="500px">
              <Text fontSize="18px" fontWeight="400">
                Сучасний світ привчає себе до економії та, відповідно, до
                переробки вторинної сировини. Наша компанія також твердо
                переконана, що відходи мають цінність. Ми знаємо, що сьогодні
                проблема роздільного збору відходів, а також їх переробки
                вимагає від нас належної уваги, запровадження найефективніших
                методів та технологій збирання та переробки.
                <br />
                <br /> Наша місія полягає в тому, щоб допомогти офісам, базам,
                виробничим, дистриб&apos;юторським та іншим підприємствам
                переробляти більше та мусолити менше. Ми із задоволенням станемо
                вашим екологічним консультантом, щоб зробити ваші зусилля з
                переробки настільки ефективними, наскільки це можливо.
                Зв&apos;яжіться з нами сьогодні та ми надамо вам послуги
                прийому, сортування та подальшої переробки відходів. <br />{' '}
                <br /> Чи знаєте ви, що до 12 мільйонів тонн пластику щороку
                потрапляє до Світового океану? А роздільне збирання відходів,
                вивезення виробничих та технічних відходів пластмас, переробка
                пластмасових відходів, яку здійснює наша компанія, обмежує
                негативний вплив на навколишнє середовище та приносить значні
                соціально-економічні вигоди
              </Text>
            </Box>
          </Flex>

          <Heading
            as="h2"
            textAlign="center"
            fontSize={{ base: '26px', lg: '40px' }}
            fontWeight="700"
            color="green.100"
          >
            Що таке переробка пластмас?
          </Heading>

          <Text fontSize="18px" fontWeight="400">
            Вторинна переробка пластмас – це відновлення різних типів пластику з
            виготовлення інших продуктів, відмінних від їх первинної форми. Ми
            купимо, вивеземо ваші пластикові відходи та перетворимо їх на інший
            продукт! Тільки подумайте, яка вигода!
          </Text>

          <Heading
            as="h2"
            textAlign="center"
            fontSize={{ base: '26px', lg: '40px' }}
            fontWeight="700"
            color="green.100"
          >
            Як ми це робимо?
          </Heading>

          <Flex
            direction={{ base: 'column-reverse', xl: 'row' }}
            alignItems={{ base: 'center', xl: 'flex-start' }}
            justifyContent="space-evenly"
            gridGap={{ base: '40px', xl: 'none' }}
          >
            <Flex direction="column" gridGap="20px" minW="300px" maxW="500px">
              <UnorderedList fontSize="18px" fontWeigt="400">
                <ListItem>
                  Спочатку ми забезпечуємо вивезення пластику до наших пунктів
                  прийому.
                </ListItem>
                <ListItem>
                  Потім сортуємо його (це можна робити в процесі роздільного
                  збору відходів або вже в пунктах прийому пластмас): кожен
                  пластиковий елемент потрібно відокремити відповідно до його
                  типу для належної його переробки в машині, що подрібнює.
                </ListItem>
                <ListItem>
                  Згодом пластмасові відходи ми очищаємо. Це значно підвищує
                  якість готового продукту.
                </ListItem>
                <ListItem>
                  Після миття ми подрібнюємо пластик на дрібні гранули, готуючи
                  їх для переробки на інші продукти.
                </ListItem>
                <ListItem>
                  Далі проводиться тестування пластикових гранул для визначення
                  їхньої якості.
                </ListItem>
                <ListItem>
                  Після цього ми плавимо подрібнений пластик з метою
                  виготовлення нових пластикових виробів.
                </ListItem>
              </UnorderedList>
            </Flex>
            <Image
              src={cap}
              maxW={{ base: '300px', lg: '500px' }}
              maxH={{ base: '300px', lg: '500px' }}
            />
          </Flex>

          <Heading
            as="h2"
            textAlign="center"
            fontSize={{ base: '26px', lg: '40px' }}
            fontWeight="700"
            color="green.100"
          >
            Переваги переробки пластику
          </Heading>

          <Flex
            direction={{ base: 'column', xl: 'row' }}
            alignItems={{ base: 'center', xl: 'flex-start' }}
            justifyContent="space-evenly"
            gridGap={{ base: '40px', xl: 'none' }}
          >
            <Image
              src={general}
              maxW={{ base: '300px', lg: '500px' }}
              maxH={{ base: '300px', lg: '500px' }}
            />
            <Box minW="300px" maxW="500px">
              <Text fontSize="18px" fontWeight="400">
                Звертайтеся до наших пунктів прийому вторинної сировини для
                подальшої його переробки. Це допоможе заощадити природні
                ресурси, необхідні у процесі виготовлення первинних пластикових
                та пластмасових виробів. Таким чином ви зробите свій внесок у
                збереження балансу в природі. Пам&apos;ятайте, що пластикові
                відходи накопичуються у землі, яка має використовуватись для
                інших цілей. Ми здійснимо вивіз пластику, переробимо його і
                таким чином очистимо місця поховання відходів, позбавляючи їх
                від небезпечних токсичних пар, які виділяє через певний період
                часу пластик, що розкладається. Якщо ви шукайте пункти прийому
                та вивезення пластику, пункти прийому та вивезення поліетилену
                поліпропілену, звертайтесь до нас! І ви зробите важливий крок до
                правильної утилізації пластикових відходів та допоможете
                зберегти нашу планету для наступних поколінь. Адже Земля – наш
                дім. Наш і тих, хто тут житиме після нас.
              </Text>
            </Box>
          </Flex>
        </Flex>
      </Container>
    </Flex>
  );
};

export default Plastic;
